In [2]:
import pandas as pd

In [30]:
ratings = pd.read_csv('ratings.csv')
ratings.head()

   userId  movieId  rating   timestamp
0       1      307     3.5  1256677221
1       1      481     3.5  1256677456
2       1     1091     1.5  1256677471
3       1     1257     4.5  1256677460
4       1     1449     4.5  1256677264

### Задание 1

In [35]:
movie_rating_5 = ratings[['movieId','rating']].query('rating == 5')
movie_rating_5.groupby('movieId').count().sort_values('rating', ascending=False).head(1)

         rating
movieId
318       48762

### Задание 2

In [29]:
power = pd.read_csv('power.csv')
power.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [30]:
pribaltian = ['Latvia', 'Lithuania', 'Estonia']
power_pribaltian = power.query('country in @pribaltian and quantity >= 0 and category in [4, 12, 21]')
power_pribaltian.head()

       country  year  quantity  category
10617  Estonia  2008       1.0         4
10618  Estonia  2007       0.0         4
10619  Estonia  2006       0.0         4
10620  Estonia  2005       1.0         4
10621  Estonia  2004       1.0         4

In [31]:
power_pribaltian['quantity'].sum()

970728.0

### Задание 3

In [27]:
read_html_ = pd.read_html('https://www.profinance.ru/')

In [28]:
read_html_[10]

              0              1             2
0           NaN  на 30.04.2021  с 01.05.2021
1  Курс доллара        74.3823       74.8451
2     Курс евро        90.1513       90.5850
3    Корзина ЦБ        81.4784       81.9281